In [44]:
import pandas as pd
weather_data= {
    'admission_date': ['1/2/2017','2/3/2018','5/6/2019','7/10/2014','6/5/2002','9/9/2009'],
    'name': ['shilpa','shanu','wasim','jay','veer','hitler'],
    'DOB': ['3 feb 1997', '7 march 1998','10 oct 1996','18 may 1993','3 feb 1997','27 sept 1996']
}
df= pd.DataFrame(weather_data)
df    # or df[:]

            DOB admission_date    name
0    3 feb 1997       1/2/2017  shilpa
1  7 march 1998       2/3/2018   shanu
2   10 oct 1996       5/6/2019   wasim
3   18 may 1993      7/10/2014     jay
4    3 feb 1997       6/5/2002    veer
5  27 sept 1996       9/9/2009  hitler

In [2]:
df.shape

(6, 3)

In [3]:
rows,columns = df.shape

In [4]:
rows

6

In [5]:
df.head()

            DOB admission_date    name
0    3 feb 1997       1/2/2017  shilpa
1  7 march 1998       2/3/2018   shanu
2   10 oct 1996       5/6/2019   wasim
3   18 may 1993      7/10/2014     jay
4    3 feb 1997       6/5/2002    veer

In [11]:
df.tail(2)   # tail(2) has printed only last two rows

            DOB admission_date    name
4    3 feb 1997       6/5/2002    veer
5  27 sept 1996       9/9/2009  hitler

In [41]:
df[::-1] # print reverse

            DOB admission_date    name
5  27 sept 1996       9/9/2009  hitler
4    3 feb 1997       6/5/2002    veer
3   18 may 1993      7/10/2014     jay
2   10 oct 1996       5/6/2019   wasim
1  7 march 1998       2/3/2018   shanu
0    3 feb 1997       1/2/2017  shilpa

In [42]:
df[:-1]  # cut last 1 row

            DOB admission_date    name
0    3 feb 1997       1/2/2017  shilpa
1  7 march 1998       2/3/2018   shanu
2   10 oct 1996       5/6/2019   wasim
3   18 may 1993      7/10/2014     jay
4    3 feb 1997       6/5/2002    veer

In [43]:
df[:]       # print all rows

            DOB admission_date    name
0    3 feb 1997       1/2/2017  shilpa
1  7 march 1998       2/3/2018   shanu
2   10 oct 1996       5/6/2019   wasim
3   18 may 1993      7/10/2014     jay
4    3 feb 1997       6/5/2002    veer
5  27 sept 1996       9/9/2009  hitler

In [82]:
df.columns[::-1]

Index(['name', 'admission_date', 'DOB'], dtype='object')

In [83]:
df['name']   #  or  df.name

0    shilpa
1     shanu
2     wasim
3       jay
4      veer
5    hitler
Name: name, dtype: object

In [87]:
df[['DOB','name']]

            DOB    name
0    3 feb 1997  shilpa
1  7 march 1998   shanu
2   10 oct 1996   wasim
3   18 may 1993     jay
4    3 feb 1997    veer
5  27 sept 1996  hitler